Repository: nangchang/DevIsland
Catalog: DevIsland/Localizable.xcstrings
Source language: en
Languages: ko

# notchAlwaysAutoApprove
source: Always Auto-Approve (Global)
ko: 항상 자동 승인 (전역)

# notchApprovalRequired
source: Approval Required
ko: 승인 필요

# notchApprove
source: Approve
ko: 승인

# notchAuto
source: Automatic
ko: 자동

# notchAutoApproveSession
source: Auto-Approve for this Session
ko: 이 세션에서 자동 승인

# notchAutoCollapseOff
source: Off
ko: 끔

# notchCharacterHidden
source: Hidden
ko: 숨김

# notchCharacterRandom
source: Random
ko: 랜덤

# notchCharacterSpecific
source: Specific
ko: 지정

# notchDenyRequest
source: Deny Request
ko: 요청 거부

# notchDismiss
source: Dismiss
ko: 닫기

# notchFocus
source: Focus
ko: 포커스

# notchFocusTerminal
source: Focus Terminal
ko: 터미널 포커스

# notchFocused
source: Monitor with focus
ko: 포커스가 있는 모니터

# notchListening
source: Listening for AI Agents…
ko: AI 에이전트 대기 중…

# notchMain
source: Main monitor
ko: 주 모니터

# notchMonitoring
source: Monitoring
ko: 모니터링

# notchMouse
source: Monitor with mouse
ko: 마우스가 있는 모니터

# notchNotification
source: Notification
ko: 알림

# notchSessions
source: Sessions
ko: 세션

# notchShapeClassic
source: Classic Island
ko: 기본 아일랜드

# notchShapeDynamicIsland
source: Dynamic Island
ko: 다이나믹 아일랜드

# notchSpecific
source: Selected monitor
ko: 선택한 모니터

# notchUnknown
source: Unknown
ko: 알 수 없음

# notifActionApprove
source: Allow
ko: 허용

# notifActionDeny
source: Deny
ko: 거부

# notifApprovalBody
source: Approval required.
ko: 승인이 필요합니다.

# notifTaskCompleteBody
source: %@ complete
ko: %@ 완료

# notifTaskCompleteBodyEmpty
source: Agent finished.
ko: 에이전트가 작업을 완료했습니다.

# notifTaskCompleteTitle
source: Task complete
ko: 작업 완료

# optTerminalSessionDefault
source: Session's terminal (automatic)
ko: 세션 터미널 자동 선택

# phOpenPeonPacksFolder
source: Packs folder
ko: 팩 폴더

# phPattern
source: Pattern (substring)
ko: 패턴 (부분 문자열)

# phResponse
source: Response text
ko: 응답 텍스트

# phToolName
source: Tool name
ko: 도구 이름

# pluginFailures
source: Errors: %lld
ko: 오류: %lld회

# pluginsEmpty
source: No plugins registered.
ko: 등록된 플러그인이 없습니다.

# pluginsListHeader
source: Built-in Plugins
ko: 내장 플러그인

# popOutWindow
source: Pop out message window
ko: 메시지 창 분리

# posCenter
source: Center
ko: 가운데

# posLeft
source: Left
ko: 왼쪽

# posRight
source: Right
ko: 오른쪽

# releaseChannelNightly
source: Nightly
ko: 나이틀리

# releaseChannelStable
source: Stable
ko: 안정 버전

# relocateErrMsg
source: An error occurred while moving the app: %@
ko: 앱을 이동하는 중 오류가 발생했습니다: %@

# relocateFailTitle
source: Move Failed
ko: 이동 실패

# relocateLaterBtn
source: Later
ko: 나중에

# relocateMessage
source: Move DevIsland to the Applications folder to continue using it.
ko: DevIsland를 응용 프로그램 폴더로 이동하여 계속 사용하시겠습니까?

# relocateMoveBtn
source: Move and Relaunch
ko: 이동 및 다시 실행

# relocateNoPermMsg
source: No write permission for the Applications folder. Please move manually using Finder.
ko: 응용 프로그램 폴더에 쓰기 권한이 없습니다. Finder에서 직접 이동해주세요.

# relocateTitle
source: Move to Applications Folder?
ko: 응용 프로그램 폴더로 이동하시겠습니까?

# renameSessionConfirm
source: Rename
ko: 변경

# renameSessionHint
source: Enter a name for session %@. Leave empty to reset.
ko: 세션 %@의 이름을 입력하세요. 비워두면 초기화됩니다.

# renameSessionPlaceholder
source: Session name
ko: 세션 이름

# renameSessionTitle
source: Rename Session
ko: 세션 이름 변경

# reqFocused
source: Focus display
ko: 포커스 화면

# reqMouse
source: Mouse display
ko: 마우스 화면

# reqNotch
source: Island display
ko: 아일랜드 화면

# secAoEFocus
source: AoE Session Focus
ko: AoE 세션 포커스

# secAppIntegrations
source: App Integrations
ko: 앱 통합

# secAutoApprovals
source: Automatic approvals
ko: 자동 승인

# secAutoInject
source: Auto-inject patterns
ko: 자동 주입 패턴

# secBridgeLog
source: Bridge log (last 20 lines)
ko: 브리지 로그 (최근 20줄)

# secBridgeLogEmpty
source: Log file not found
ko: 로그 파일 없음

# secBridgeScript
source: Bridge Script
ko: 브리지 스크립트

# secCaffeineBehavior
source: Behavior
ko: 동작

# secCaffeineExcludedSSIDs
source: Excluded Wi-Fi Networks
ko: 예외 Wi-Fi 네트워크

# secCaffeineSessionTimeout
source: Session Idle Timeout
ko: 세션 유휴 타임아웃

# secCaffeineStatus
source: Status
ko: 현재 상태

# secCodexRules
source: Codex persistent SQLite rules
ko: Codex 영구 SQLite 규칙

# secFallback
source: Transport failure fallback
ko: 전송 실패 폴백

# secGlobalRules
source: Global auto-approval tools
ko: 전역 자동 승인 도구

# secHookStatus
source: Hook install status
ko: 훅 설치 상태

# secLanguage
source: Language
ko: 언어

# secLastEvent
source: Last event received
ko: 마지막 이벤트 수신

# secNotch
source: Island
ko: 아일랜드

# secNotchAutoExpand
source: Auto-expand
ko: 자동 펼침

# secNotchCharacters
source: Buddies
ko: 버디

# secNotchExpandTriggers
source: When to expand
ko: 자동 펼침 조건

# secNotifications
source: Notifications
ko: 알림

# secOpenPeonCategories
source: Categories
ko: 카테고리

# secOpenPeonPlayback
source: Playback
ko: 재생

# secOpenPeonSoundPacks
source: Sound packs
ko: 사운드팩

# secOpenPeonValidation
source: Validation
ko: 검증

# secPTYWrapper
source: PTY Wrapper
ko: PTY 래퍼

# secPermissionTimeout
source: Permission timeout
ko: 권한 요청 타임아웃

# secPreferredTerminal
source: Default Terminal
ko: 기본 터미널

# secReplayRetention
source: Replay log retention
ko: 리플레이 로그 보관

# secRequests
source: Requests
ko: 요청

# secSessionRules
source: Session auto-approval tools
ko: 세션 자동 승인 도구

# secSounds
source: Sounds
ko: 사운드

# secStartup
source: Startup
ko: 시작

# secTimeouts
source: Timeouts
ko: 타임아웃

# secTokenSecurity
source: Token security
ko: 토큰 보안

# secTransport
source: Transport
ko: 전송

# secUnixSocket
source: Unix domain socket
ko: Unix 도메인 소켓

# secUpdates
source: Updates
ko: 업데이트

# secUsage
source: Usage
ko: 사용법

# sessionDescriptionConfirm
source: Save
ko: 저장

# sessionDescriptionHint
source: Add notes for session %@. Leave empty to clear.
ko: 세션 %@의 설명을 입력하세요. 비워두면 삭제됩니다.

# sessionDescriptionTitle
source: Session Description
ko: 세션 설명

source: Session ended
ko: 세션이 종료되었습니다

# statusAutoApproved
source: Auto-Approved
ko: 자동 승인됨

# statusAutoEdit
source: Auto-Edit
ko: 자동 편집

# statusBypassed
source: Bypassed
ko: 우회됨

# statusPending
source: Pending
ko: 대기 중

# statusPolicyApproved
source: Policy-Approved
ko: 정책 승인됨

# statusPolicyDenied
source: Policy-Denied
ko: 정책 거부됨

# tabAdvanced
source: Advanced
ko: 고급

# tabApproval
source: Approval
ko: 승인

# tabBridge
source: Bridge / IPC
ko: 브리지 / IPC

# tabDiagnostics
source: Diagnostics
ko: 진단

# tabExperimental
source: Experimental
ko: 실험적

# tabExtras
source: Extras
ko: 부가기능

# tabGeneral
source: General
ko: 일반

# tabIntegrations
source: Integrations
ko: 통합

# tabIsland
source: Island
ko: 아일랜드

# tabPlugins
source: Plugins
ko: 플러그인

# tabProviders
source: Providers
ko: 공급자

# tasksQueued
source: %lld tasks queued
ko: %lld개 대기 중

# terminalCheckMsg
source: Check terminal window (%@)
ko: 터미널 창을 확인해 주세요 (%@)

# terminalWaiting
source: Waiting for terminal confirmation…
ko: 터미널 확인 대기 중...

# timeJustNow
source: Just now
ko: 방금

# timeMinsAgo
source: %lldm ago
ko: %lld분 전

# timeSecsAgo
source: %llds ago
ko: %lld초 전

# transportTCP
source: TCP loopback
ko: TCP 루프백

# transportUnix
source: Unix domain socket
ko: Unix 도메인 소켓

# updateAvailableMsg
source: DevIsland %@ is available. Install and relaunch?
ko: DevIsland %@이(가) 출시되었습니다. 설치 후 재실행하시겠습니까?

# updateAvailableTitle
source: Update Available
ko: 업데이트 가능

# updateChangeLogTitle
source: Release Notes / Change Log
ko: 릴리즈 노트 / 변경 로그

# updateCheckFailedTitle
source: Update Check Failed
ko: 업데이트 확인 실패

# updateDownloading
source: Downloading…
ko: 다운로드 중…

# updateFailedTitle
source: Update Failed
ko: 업데이트 실패

# updateInstallBtn
source: Install and Relaunch
ko: 설치 후 재실행

# updateInstalling
source: Installing…
ko: 설치 중…

# updateInvalidResponseMsg
source: Invalid response from GitHub.
ko: GitHub에서 잘못된 응답을 받았습니다.

# updateLaterBtn
source: Later
ko: 나중에

# updateNoAssetMsg
source: No DMG found in the latest release.
ko: 최신 릴리즈에서 DMG를 찾을 수 없습니다.

# updateRelaunching
source: Relaunching…
ko: 재실행 중…

# updateUpToDateMsg
source: DevIsland %@ is the latest version.
ko: DevIsland %@이 최신 버전입니다.

# updateUpToDateTitle
source: Up to Date
ko: 최신 버전

# warnGraceMode
source: IPC token file not found — running in grace mode. All incoming connections are accepted without authentication.
ko: IPC 토큰 파일이 없어 grace mode로 실행 중입니다. 모든 수신 연결이 인증 없이 허용됩니다.

# warnProjectSettings
source: Project settings can be committed to the repository. Review changes before committing.
ko: 프로젝트 설정은 저장소에 커밋될 수 있습니다. 커밋 전에 변경 사항을 검토하세요.

# winApprovalRules
source: Approval Rules
ko: 승인 규칙

# winPTYTranscript
source: PTY Transcript
ko: PTY 트랜스크립트

# winReplayLog
source: Replay Log
ko: 재실행 로그

# winSessionHistory
source: Session History
ko: 세션 기록

# winSettings
source: DevIsland Settings
ko: DevIsland 설정
